app/controllers/scams_controller.rb

SELECT  "scams".* FROM "scams" WHERE "scams"."id" = ? LIMIT 1  [["id", 4]]
---
  def show
    id = params[:id] # retrieve scam ID from URI route
    @scam = Scam.find(id) # look up scam by unique ID

SELECT "scams".* FROM "scams"
SELECT "users".* FROM "users" WHERE "users"."id" IN (22, 23, 24, 25, 27)
---
  def index
    @scams = Scam.includes(:user).all

INSERT INTO "scams" ("title", "category", "zipcode", "description", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "New Scam Title"], ["category", "phone"], ["zipcode", "10025"], ["description", "Description of the scam..."], ["url", ""], ["user_id", 1]]
---
  def create
    @scam = Scam.create!(scam_params.merge(user_id: current_user.id))

SELECT  "scams".* FROM "scams" WHERE "scams"."id" = ? LIMIT 1  [["id", 4]]
---
  def edit
    @scam = Scam.find params[:id]

SELECT  "scams".* FROM "scams" WHERE "scams"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "scams" SET "url" = ? WHERE "scams"."id" = ?  [["url", "https://phishorfish.s3.us-east-2.amazonaws.com/uploads/1701639871199"], ["id", 15]]
---
  def update
    @scam = Scam.find params[:id]
    @scam.update_attributes!(scam_params)

SELECT  "scams".* FROM "scams" WHERE "scams"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "scams" WHERE "scams"."id" = ?  [["id", 4]]
---
  def destroy
    @scam = Scam.find(params[:id])
    @scam.destroy