app/controllers/scam_articles_controller.rb

    def index
      @scam_articles = ScamArticle.all
---
SELECT "scam_articles".* FROM "scam_articles"

    def show
      @scam_article = ScamArticle.find(params[:id])
---
SELECT  "scam_articles".* FROM "scam_articles" WHERE "scam_articles"."id" = ? LIMIT 1  [["id", 3]]

    def create
      @scam_article = ScamArticle.new(scam_article_params)
      if @scam_article.save
---
INSERT INTO "scam_articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "New Article"], ["body", "New Body"], ["created_at", "2023-11-16 00:02:39.871437"], ["updated_at", "2023-11-16 00:02:39.871437"]]

    def edit
      @scam_article = ScamArticle.find(params[:id])
---
SELECT  "scam_articles".* FROM "scam_articles" WHERE "scam_articles"."id" = ? LIMIT 1  [["id", 1]]

    def update
      @scam_article = ScamArticle.find(params[:id])
      if @scam_article.update(scam_article_params)
---
SELECT  "scam_articles".* FROM "scam_articles" WHERE "scam_articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "scam_articles" SET "title" = ?, "body" = ?, "published_at" = ?, "updated_at" = ? WHERE "scam_articles"."id" = ?  [["title", "Social Media Scams"], ["body", "body of the scam article..."], ["published_at", "2023-11-15"], ["updated_at", "2023-11-15 21:02:20.754735"], ["id", 1]]

    def destroy
      @scam_article = ScamArticle.find(params[:id])
      @scam_article.destroy
---
SELECT  "scam_articles".* FROM "scam_articles" WHERE "scam_articles"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "scam_articles" WHERE "scam_articles"."id" = ?  [["id", 1]]