app/controllers/scams_controller.rb

  def my_posts
    @user = current_user
    @my_posts = Scam.where(user_id: @user.id)
---
SELECT "scams".* FROM "scams" WHERE "scams"."user_id" = ?  [["user_id", 8]]